Revit 2017 API
RenderingSettings.ResolutionTarget Property
 The resolution target.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public ResolutionTarget ResolutionTarget { get; set; }
Visual Basic
Public Property ResolutionTarget As ResolutionTarget
	Get
	Set
Visual C++
public:
property ResolutionTarget ResolutionTarget {
	ResolutionTarget get ();
	void set (ResolutionTarget value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The enum value is not valid for ResolutionTarget. -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace